### Problem: Customer Purchase Trends

You have two tables, **Customers** and **Purchases**:

1. **Customers**:
   - `CustomerID` (Primary Key)
   - `CustomerName`
   - `City`
   - `SignupDate`

2. **Purchases**:
   - `PurchaseID` (Primary Key)
   - `CustomerID` (Foreign Key)
   - `Product`
   - `Quantity`
   - `Price`
   - `PurchaseDate`

### Task:
1. Calculate the **total spending per customer** and **group it by city**.
2. **Identify the top 3 customers** with the highest spending from **each city**.
3. **Find customers who have not made any purchases** after signing up (they exist in `Customers` but have no matching rows in `Purchases`).
4. **Calculate the average spending** of customers who signed up within the last 6 months before the most recent signup date in the data.

---

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:password@localhost:3306/sales

'Connected: root@sales'

Task:
Calculate the total revenue generated from sales for each sales status
Find the product with the highest total revenue.
Include the product_id, total revenue, and the total quantity sold in your result.
Sort the results by total revenue in descending order.

In [4]:
%sql SHOW TABLES

 * mysql+pymysql://root:***@localhost:3306/sales
2 rows affected.

[('customer',), ('orders',)]

In [9]:
%%sql 
SELECT 
    status, SUM(total_amount) total
FROM orders 
GROUP BY status
ORDER BY total

 * mysql+pymysql://root:***@localhost:3306/sales
4 rows affected.

[('Pending', Decimal('4043.09')),
 ('Cancelled', Decimal('4164.09')),
 ('Delivered', Decimal('7240.55')),
 ('Shipped', Decimal('7648.53'))]

In [6]:
 %sql SELECT * FROM Purchases

 * mysql+pymysql://root:***@localhost:3306/sales
24 rows affected.

[(1, 1, 'Laptop', 1, Decimal('1200.00'), datetime.date(2023, 2, 15)),
 (2, 1, 'Headphones', 2, Decimal('50.00'), datetime.date(2023, 3, 1)),
 (3, 2, 'Smartphone', 1, Decimal('800.00'), datetime.date(2022, 6, 18)),
 (4, 3, 'Tablet', 1, Decimal('300.00'), datetime.date(2023, 4, 25)),
 (5, 4, 'Smartwatch', 1, Decimal('250.00'), datetime.date(2022, 9, 10)),
 (6, 5, 'Laptop', 1, Decimal('1100.00'), datetime.date(2023, 7, 1)),
 (7, 6, 'Headphones', 3, Decimal('45.00'), datetime.date(2023, 5, 15)),
 (8, 7, 'Tablet', 1, Decimal('350.00'), datetime.date(2023, 1, 25)),
 (9, 8, 'Smartphone', 1, Decimal('700.00'), datetime.date(2023, 2, 28)),
 (10, 9, 'Laptop', 1, Decimal('1300.00'), datetime.date(2023, 6, 20)),
 (11, 10, 'Smartwatch', 2, Decimal('220.00'), datetime.date(2023, 7, 10)),
 (12, 11, 'Tablet', 1, Decimal('400.00'), datetime.date(2023, 9, 5)),
 (13, 12, 'Smartphone', 1, Decimal('750.00'), datetime.date(2023, 1, 18)),
 (14, 13, 'Headphones', 2, Decimal('60.00'), datetime.date(2023, 2, 10)),
 (15, 14, 'Smartphone', 1, Decimal('900.00'), datetime.date(2023, 9, 23)),
 (16, 15, 'Smartwatch', 2, Decimal('230.00'), datetime.date(2023, 6, 15)),
 (17, 2, 'Tablet', 1, Decimal('350.00'), datetime.date(2022, 7, 23)),
 (18, 5, 'Laptop', 1, Decimal('1050.00'), datetime.date(2023, 8, 5)),
 (19, 9, 'Headphones', 1, Decimal('60.00'), datetime.date(2023, 8, 19)),
 (20, 6, 'Smartphone', 1, Decimal('780.00'), datetime.date(2023, 5, 30)),
 (21, 10, 'Smartwatch', 3, Decimal('250.00'), datetime.date(2023, 8, 12)),
 (22, 12, 'Laptop', 1, Decimal('1250.00'), datetime.date(2023, 7, 1)),
 (23, 7, 'Tablet', 1, Decimal('360.00'), datetime.date(2023, 3, 11)),
 (24, 13, 'Smartphone', 1, Decimal('950.00'), datetime.date(2023, 6, 20))]

In [4]:
#Calculate the total spending per customer and group it by city.

In [13]:
%%sql
-- Select the city, customer name, and total spending for each customer in that city
SELECT 
    c.City,                -- The city of the customer
    c.CustomerName,        -- The name of the customer
    SUM(p.Quantity * p.Price) AS Total  -- Calculate total spending by multiplying quantity by price and summing up
FROM Customers c         -- From the Customers table
JOIN Purchases p        -- Join with the Purchases table
ON c.CustomerID = p.CustomerID  -- Match records based on CustomerID
GROUP BY c.City, c.CustomerName;  -- Group the results by city and customer name

 * mysql+pymysql://root:***@localhost:3306/sales
15 rows affected.

[('New York', 'Alice Johnson', Decimal('1300.00')),
 ('Los Angeles', 'Bob Smith', Decimal('1150.00')),
 ('Chicago', 'Charlie Lee', Decimal('300.00')),
 ('New York', 'Diana Adams', Decimal('250.00')),
 ('Los Angeles', 'Ethan Clark', Decimal('2150.00')),
 ('Chicago', 'Fiona Green', Decimal('915.00')),
 ('New York', 'George Baker', Decimal('710.00')),
 ('Los Angeles', 'Helen Carter', Decimal('700.00')),
 ('Chicago', 'Irene Phillips', Decimal('1360.00')),
 ('New York', 'Jack Taylor', Decimal('1190.00')),
 ('Chicago', 'Kathy White', Decimal('400.00')),
 ('Los Angeles', 'Liam Brown', Decimal('2000.00')),
 ('Chicago', 'Mona Davis', Decimal('1070.00')),
 ('New York', 'Nathan Evans', Decimal('900.00')),
 ('Los Angeles', 'Olivia Wright', Decimal('460.00'))]

In [ ]:
#Identify the top 3 customers with the highest spending from each city.

In [22]:
%%sql
WITH ranked_spendings AS (
    -- Begin CTE to calculate total spendings and rank customers within their cities
    SELECT 
        c.City,                -- The city of the customer
        c.CustomerName,        -- The name of the customer
        SUM(p.Quantity * p.Price) AS Total,  -- Calculate total spending by multiplying quantity by price and summing up
        ROW_NUMBER() OVER (PARTITION BY c.City ORDER BY SUM(p.Quantity * p.Price) DESC) AS Ranking -- Rank customers based on total spending within each city
    FROM Customers c         -- Select from the Customers table
    JOIN Purchases p        -- Join with the Purchases table to access purchase details
    ON c.CustomerID = p.CustomerID  -- Match records based on CustomerID
    GROUP BY c.City, c.CustomerName  -- Group results by city and customer name to aggregate total spendings
) 
-- Select the city, customer name, and total spending for the top 3 customers in each city
SELECT 
    City, CustomerName, Total
FROM ranked_spendings
WHERE Ranking IN (1, 2, 3);  -- Filter to include only the top 3 spenders in each city

 * mysql+pymysql://root:***@localhost:3306/sales
9 rows affected.

[('Chicago', 'Irene Phillips', Decimal('1360.00')),
 ('Chicago', 'Mona Davis', Decimal('1070.00')),
 ('Chicago', 'Fiona Green', Decimal('915.00')),
 ('Los Angeles', 'Ethan Clark', Decimal('2150.00')),
 ('Los Angeles', 'Liam Brown', Decimal('2000.00')),
 ('Los Angeles', 'Bob Smith', Decimal('1150.00')),
 ('New York', 'Alice Johnson', Decimal('1300.00')),
 ('New York', 'Jack Taylor', Decimal('1190.00')),
 ('New York', 'Nathan Evans', Decimal('900.00'))]

In [23]:
#Find customers who have not made any purchases after signing up (they exist in Customers but have no matching rows in Purchases).

In [27]:
%%sql
-- Select all customer details from the Customers table where they have not made any purchases
SELECT * 
FROM Customers
WHERE CustomerID NOT IN
(
    -- Subquery to select all CustomerIDs from the Purchases table (i.e., customers who have made purchases)
    SELECT CustomerID 
    FROM Purchases
)

 * mysql+pymysql://root:***@localhost:3306/sales
0 rows affected.

[]

In [28]:
# Calculate the average spending of customers who signed up within the last 6 months before the most recent signup date in the data.

In [55]:
%%sql
-- Calculate the average spending for customers who signed up in the last 6 months

SELECT 
    ROUND(AVG(Quantity * Price), 2) AS AvgSpending -- Calculate the average spending (rounded to 2 decimal places)
FROM Purchases
WHERE CustomerID IN(
    -- Subquery to find customers who signed up in the last 6 months
    SELECT 
        CustomerID -- Select the CustomerID for customers who meet the condition
    FROM Customers
    WHERE TIMESTAMPDIFF(MONTH, SignupDate, 
        -- Find the time difference in months between the signup date and the most recent signup date
        (SELECT MAX(SignupDate) FROM Customers)) <= 6  -- Check if the signup date is within the last 6 months
)

 * mysql+pymysql://root:***@localhost:3306/sales
1 rows affected.

[(Decimal('644.23'),)]